In [1]:
%load_ext sql

In [3]:
%sql sqlite:///newdb.db

In [4]:
%%sql
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    salary DECIMAL(10,2)
);

 * sqlite:///newdb.db
(sqlite3.OperationalError) table employees already exists
[SQL: CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    salary DECIMAL(10,2)
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [4]:
%%sql
INSERT INTO employees VALUES 
(1, 'Aarushi', 55000),
(2, 'John', 60000);

 * sqlite:///newdb.db
(sqlite3.IntegrityError) UNIQUE constraint failed: employees.id
[SQL: INSERT INTO employees VALUES
(1, 'Aarushi', 55000),
(2, 'John', 60000);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [5]:
%%sql
SELECT * FROM employees;

 * sqlite:///newdb.db
Done.

[(1, 'Aarushi', 55000), (2, 'John', 60000)]

Hotel Booking & Management System:
A hotel management system that manages customers, hotels, rooms, bookings, and payments.

Customers Table Creation

In [7]:
%%sql
CREATE TABLE customers (
    customer_id INTEGER PRIMARY KEY,
    name TEXT,
    email TEXT,
    phone TEXT,
    join_date DATE
);

 * sqlite:///newdb.db
Done.

[]

Inserting Into Table customers

In [8]:
%%sql
INSERT INTO customers VALUES
(1, 'Aarav Shah', 'aarav@example.com', '980000001', '2023-01-10'),
(2, 'Mina Koirala', 'mina@example.com', '980000002', '2023-01-15'),
(3, 'Rohan Thapa', 'rohan@example.com', '980000003', '2023-01-20'),
(4, 'Sita Rai', 'sita@example.com', '980000004', '2023-01-22'),
(5, 'Kriti Gurung', 'kriti@example.com', '980000005', '2023-02-01'),
(6, 'Anish KC', 'anish@example.com', '980000006', '2023-02-05'),
(7, 'Luna Sharma', 'luna@example.com', '980000007', '2023-02-10'),
(8, 'Sam Singh', 'sam@example.com', '980000008', '2023-02-12'),
(9, 'Meera Tamang', 'meera@example.com', '980000009', '2023-02-15'),
(10, 'John Rai', 'john@example.com', '980000010', '2023-02-20'),
(11, 'Tara Basnet', 'tara@example.com', '980000011', '2023-02-25'),
(12, 'Raj Lama', 'raj@example.com', '980000012', '2023-03-01'),
(13, 'Nisha Shrestha', 'nisha@example.com', '980000013', '2023-03-05'),
(14, 'Isha Thapa', 'isha@example.com', '980000014', '2023-03-10'),
(15, 'Arjun Gurung', 'arjun@example.com', '980000015', '2023-03-12'),
(16, 'Riya Koirala', 'riya@example.com', '980000016', '2023-03-15'),
(17, 'Kabir Shah', 'kabir@example.com', '980000017', '2023-03-18'),
(18, 'Sara Tamang', 'sara@example.com', '980000018', '2023-03-20'),
(19, 'Vivaan Rai', 'vivaan@example.com', '980000019', '2023-03-22'),
(20, 'Diya Sharma', 'diya@example.com', '980000020', '2023-03-25');

 * sqlite:///newdb.db
20 rows affected.

[]

Hotels Table Creation

In [9]:
%%sql
CREATE TABLE hotels (
    hotel_id INTEGER PRIMARY KEY,
    name TEXT,
    city TEXT,
    star_rating INT
);

 * sqlite:///newdb.db
Done.

[]

Inserting into hotels table

In [8]:
%%sql
INSERT INTO hotels VALUES
(1, 'Sunrise Hotel', 'Kathmandu', 4),
(2, 'Himalayan Inn', 'Pokhara', 5),
(3, 'City Lodge', 'Lalitpur', 3),
(4, 'Mountain Retreat', 'Nagarkot', 4),
(5, 'Peaceful Stay', 'Bhaktapur', 3),
(6, 'Everest View', 'Namche', 5),
(7, 'Lake Side Hotel', 'Pokhara', 4),
(8, 'Royal Palace Hotel', 'Kathmandu', 5),
(9, 'Cozy Corner', 'Lalitpur', 3),
(10, 'Sunset Inn', 'Nagarkot', 4);

 * sqlite:///newdb.db
10 rows affected.

[]

"Rooms" Table Creation

In [10]:
%%sql
CREATE TABLE rooms (
    room_id INTEGER PRIMARY KEY,
    hotel_id INT,
    room_number TEXT,
    room_type TEXT,   -- Single, Double, Suite
    price_per_night INT,
    FOREIGN KEY(hotel_id) REFERENCES hotels(hotel_id)
);

 * sqlite:///newdb.db
Done.

[]

Inserting into "Rooms" Table

In [12]:
%%sql
INSERT INTO rooms VALUES
(1, 1, '101', 'Single', 3000),
(2, 1, '102', 'Double', 4500),
(3, 2, '201', 'Suite', 8000),
(4, 2, '202', 'Double', 5000),
(5, 3, '301', 'Single', 2500),
(6, 3, '302', 'Double', 4000),
(7, 4, '401', 'Suite', 7000),
(8, 4, '402', 'Single', 3500),
(9, 5, '501', 'Double', 4000),
(10, 5, '502', 'Single', 2500),
(11, 6, '601', 'Suite', 9000),
(12, 6, '602', 'Double', 5000),
(13, 7, '701', 'Double', 4500),
(14, 7, '702', 'Single', 3000),
(15, 8, '801', 'Suite', 8500),
(16, 8, '802', 'Double', 5000),
(17, 9, '901', 'Single', 2500),
(18, 9, '902', 'Double', 4000),
(19, 10, '1001', 'Suite', 7500),
(20, 10, '1002', 'Single', 3000);

 * sqlite:///newdb.db
20 rows affected.

[]

"Bookings" Table Creation

In [14]:
%%sql
CREATE TABLE bookings (
    booking_id INTEGER PRIMARY KEY,
    customer_id INT,
    room_id INT,
    check_in DATE,
    check_out DATE,
    FOREIGN KEY(customer_id) REFERENCES customers(customer_id),
    FOREIGN KEY(room_id) REFERENCES rooms(room_id)
);

 * sqlite:///newdb.db
Done.

[]

Inserting into "Bookings" table

In [15]:
%%sql
INSERT INTO bookings VALUES
(1, 1, 1, '2024-05-01', '2024-05-05'),
(2, 2, 3, '2024-05-02', '2024-05-04'),
(3, 3, 5, '2024-05-03', '2024-05-06'),
(4, 4, 2, '2024-05-04', '2024-05-07'),
(5, 5, 6, '2024-05-05', '2024-05-08'),
(6, 6, 7, '2024-05-06', '2024-05-09'),
(7, 7, 8, '2024-05-07', '2024-05-10'),
(8, 8, 9, '2024-05-08', '2024-05-12'),
(9, 9, 10, '2024-05-09', '2024-05-11'),
(10, 10, 11, '2024-05-10', '2024-05-13'),
(11, 11, 12, '2024-05-11', '2024-05-14'),
(12, 12, 13, '2024-05-12', '2024-05-15'),
(13, 13, 14, '2024-05-13', '2024-05-16'),
(14, 14, 15, '2024-05-14', '2024-05-18'),
(15, 15, 16, '2024-05-15', '2024-05-19'),
(16, 16, 17, '2024-05-16', '2024-05-20'),
(17, 17, 18, '2024-05-17', '2024-05-21'),
(18, 18, 19, '2024-05-18', '2024-05-22'),
(19, 19, 20, '2024-05-19', '2024-05-23'),
(20, 20, 1, '2024-05-20', '2024-05-25');

 * sqlite:///newdb.db
20 rows affected.

[]

"Payments" table creation

In [16]:
%%sql
CREATE TABLE payments (
    payment_id INTEGER PRIMARY KEY,
    booking_id INT,
    amount INT,
    payment_date DATE,
    FOREIGN KEY(booking_id) REFERENCES bookings(booking_id)
);

 * sqlite:///newdb.db
Done.

[]

Inserting into "Payments" table

In [17]:
%%sql
INSERT INTO payments VALUES
(1, 1, 15000, '2024-04-30'),
(2, 2, 16000, '2024-05-01'),
(3, 3, 12000, '2024-05-02'),
(4, 4, 13500, '2024-05-03'),
(5, 5, 14500, '2024-05-04'),
(6, 6, 15500, '2024-05-05'),
(7, 7, 16500, '2024-05-06'),
(8, 8, 14000, '2024-05-07'),
(9, 9, 12500, '2024-05-08'),
(10, 10, 15000, '2024-05-09'),
(11, 11, 15500, '2024-05-10'),
(12, 12, 14500, '2024-05-11'),
(13, 13, 13500, '2024-05-12'),
(14, 14, 16000, '2024-05-13'),
(15, 15, 15000, '2024-05-14'),
(16, 16, 14000, '2024-05-15'),
(17, 17, 15500, '2024-05-16'),
(18, 18, 14500, '2024-05-17'),
(19, 19, 15000, '2024-05-18'),
(20, 20, 15500, '2024-05-19');

 * sqlite:///newdb.db
20 rows affected.

[]

List all customers

In [18]:
%%sql
SELECT * FROM customers;

 * sqlite:///newdb.db
Done.

[(1, 'Aarav Shah', 'aarav@example.com', '980000001', '2023-01-10'),
 (2, 'Mina Koirala', 'mina@example.com', '980000002', '2023-01-15'),
 (3, 'Rohan Thapa', 'rohan@example.com', '980000003', '2023-01-20'),
 (4, 'Sita Rai', 'sita@example.com', '980000004', '2023-01-22'),
 (5, 'Kriti Gurung', 'kriti@example.com', '980000005', '2023-02-01'),
 (6, 'Anish KC', 'anish@example.com', '980000006', '2023-02-05'),
 (7, 'Luna Sharma', 'luna@example.com', '980000007', '2023-02-10'),
 (8, 'Sam Singh', 'sam@example.com', '980000008', '2023-02-12'),
 (9, 'Meera Tamang', 'meera@example.com', '980000009', '2023-02-15'),
 (10, 'John Rai', 'john@example.com', '980000010', '2023-02-20'),
 (11, 'Tara Basnet', 'tara@example.com', '980000011', '2023-02-25'),
 (12, 'Raj Lama', 'raj@example.com', '980000012', '2023-03-01'),
 (13, 'Nisha Shrestha', 'nisha@example.com', '980000013', '2023-03-05'),
 (14, 'Isha Thapa', 'isha@example.com', '980000014', '2023-03-10'),
 (15, 'Arjun Gurung', 'arjun@example.com', '980000015', '2023-03-12'),
 (16, 'Riya Koirala', 'riya@example.com', '980000016', '2023-03-15'),
 (17, 'Kabir Shah', 'kabir@example.com', '980000017', '2023-03-18'),
 (18, 'Sara Tamang', 'sara@example.com', '980000018', '2023-03-20'),
 (19, 'Vivaan Rai', 'vivaan@example.com', '980000019', '2023-03-22'),
 (20, 'Diya Sharma', 'diya@example.com', '980000020', '2023-03-25')]

Displaying hotels which are in "Pokhara"

In [9]:
%%sql
SELECT name, city, star_rating 
FROM hotels 
WHERE city = 'Pokhara';

 * sqlite:///newdb.db
Done.

[('Himalayan Inn', 'Pokhara', 5), ('Lake Side Hotel', 'Pokhara', 4)]

To check what cities we actually have

In [10]:
%%sql
SELECT DISTINCT city FROM hotels;

 * sqlite:///newdb.db
Done.

[('Kathmandu',),
 ('Pokhara',),
 ('Lalitpur',),
 ('Nagarkot',),
 ('Bhaktapur',),
 ('Namche',)]

Displaying Single Rooms

In [11]:
%%sql
SELECT room_number, hotel_id, price_per_night 
FROM rooms 
WHERE room_type = 'Single';

 * sqlite:///newdb.db
Done.

[('101', 1, 3000),
 ('301', 3, 2500),
 ('402', 4, 3500),
 ('502', 5, 2500),
 ('702', 7, 3000),
 ('901', 9, 2500),
 ('1002', 10, 3000)]

Displaying all bookings for customer "Aarav Shah"

In [12]:
%%sql
SELECT b.booking_id, r.room_number, h.name AS hotel_name, b.check_in, b.check_out
FROM bookings b
JOIN customers c ON b.customer_id = c.customer_id
JOIN rooms r ON b.room_id = r.room_id
JOIN hotels h ON r.hotel_id = h.hotel_id
WHERE c.name = 'Aarav Shah';

 * sqlite:///newdb.db
Done.

[(1, '101', 'Sunrise Hotel', '2024-05-01', '2024-05-05')]

Displaying all Payments above 15,000

In [13]:
%%sql
SELECT * FROM payments
WHERE amount > 15000;

 * sqlite:///newdb.db
Done.

[(2, 2, 16000, '2024-05-01'),
 (6, 6, 15500, '2024-05-05'),
 (7, 7, 16500, '2024-05-06'),
 (11, 11, 15500, '2024-05-10'),
 (14, 14, 16000, '2024-05-13'),
 (17, 17, 15500, '2024-05-16'),
 (20, 20, 15500, '2024-05-19')]

Total Customers count

In [15]:
%%sql
SELECT COUNT(*) AS total_customers FROM customers;

 * sqlite:///newdb.db
Done.

[(20,)]

Count of number of rooms per hotel

In [21]:
%%sql
SELECT hotel_id, COUNT(*) AS total_rooms
FROM rooms
GROUP BY hotel_id;

 * sqlite:///newdb.db
Done.

[(1, 2),
 (2, 2),
 (3, 2),
 (4, 2),
 (5, 2),
 (6, 2),
 (7, 2),
 (8, 2),
 (9, 2),
 (10, 2)]

Customers Total Payments

In [22]:
%%sql
SELECT c.name, SUM(p.amount) AS total_paid
FROM payments p
JOIN bookings b ON p.booking_id = b.booking_id
JOIN customers c ON b.customer_id = c.customer_id
GROUP BY c.customer_id;

 * sqlite:///newdb.db
Done.

[('Aarav Shah', 15000),
 ('Mina Koirala', 16000),
 ('Rohan Thapa', 12000),
 ('Sita Rai', 13500),
 ('Kriti Gurung', 14500),
 ('Anish KC', 15500),
 ('Luna Sharma', 16500),
 ('Sam Singh', 14000),
 ('Meera Tamang', 12500),
 ('John Rai', 15000),
 ('Tara Basnet', 15500),
 ('Raj Lama', 14500),
 ('Nisha Shrestha', 13500),
 ('Isha Thapa', 16000),
 ('Arjun Gurung', 15000),
 ('Riya Koirala', 14000),
 ('Kabir Shah', 15500),
 ('Sara Tamang', 14500),
 ('Vivaan Rai', 15000),
 ('Diya Sharma', 15500)]

Bookings with check-in in May 2024

In [4]:
%%sql
SELECT * FROM bookings
WHERE check_in >= '2024-05-10' AND check_out <= '2024-05-31';

 * sqlite:///newdb.db
Done.

[(10, 10, 11, '2024-05-10', '2024-05-13'),
 (11, 11, 12, '2024-05-11', '2024-05-14'),
 (12, 12, 13, '2024-05-12', '2024-05-15'),
 (13, 13, 14, '2024-05-13', '2024-05-16'),
 (14, 14, 15, '2024-05-14', '2024-05-18'),
 (15, 15, 16, '2024-05-15', '2024-05-19'),
 (16, 16, 17, '2024-05-16', '2024-05-20'),
 (17, 17, 18, '2024-05-17', '2024-05-21'),
 (18, 18, 19, '2024-05-18', '2024-05-22'),
 (19, 19, 20, '2024-05-19', '2024-05-23'),
 (20, 20, 1, '2024-05-20', '2024-05-25')]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql